/* --------------------------------------------------------------------- */
/* Variables                                                             */
/* --------------------------------------------------------------------- */

// [O] let 변수 : 런타임 중에 값이 변할 수 있음
// [O] const 런타임 중에 변하지 않는 값 (상수)


/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// - 갯수 별 상품 가격 계산하기
// - 구매 제품 가격의 총 합
// - 1년 기준 일자 수
// - 구매 결제 여부
// - 구매 결제 내역
// - 브랜드 접두사
// - 오늘의 운세
// - 상품 정보


/* variables ----------------------------------------------------------- */

let today_fortune = '오늘의 운세';
console.log(today_fortune);

/* constant variables -------------------------------------------------- */

const BRAND_PREFIX = 'SAMSUNG';
console.log(BRAND_PREFIX);